{
    "candidates": [
        {
            "name": "Chase Oliver",
            "slug": "chase-oliver",
            "withdrawn": false,
            "party": "Libertarian",
            "current_position": "Import Shipping Business Professional",
            "announcement_date": "May 25, 2024",
            "past_roles": [
                {
                    "role": "Professional in Import Shipping Business",
                    "start_year": 2022,
                    "end_year": 2024
                }
            ],
            "quote": "I would like my term to be a symbol that having more choices on the ballot and more voices in the debate is a positive for the politics of this nation.",
            "key_legislation_or_accomplishments": [],
            "key_policy_points": [
                "Criminal Justice Reform",
                "End Foreign Wars",
                "End the Drug War"
            ],
            "policy_perspectives": {
                "left_leaning": "Left-leaning individuals might appreciate Chase Oliver's pro-choice stance on abortion, aligning with liberal values despite his opposition to taxpayer-funded abortions. His support for LGBTQ+ rights, including equal adoption rights for same-sex couples, resonates well with progressive ideologies. However, his endorsement of a free market solution to climate change might not suffice for those favoring direct government intervention. Additionally, Oliver's strong advocacy for gun rights, although inclusive, could clash with the left's typical stance favoring stricter gun control.",
                "centrist": "Centrists might find Chase Oliver's political positions appealing in several areas. His support for ranked-choice voting aligns with a pragmatic approach to electoral reform, potentially improving the electoral system. Oliver's stance on ending qualified immunity for law enforcement suggests a balanced approach to police reform. His advocacy for an 'Ellis Island-style' immigration system could attract centrists looking for a moderate solution in immigration debates. However, his proposal to abolish the United States Department of Education, favoring state-by-state education solutions, might be seen as a practical yet divisive approach.",
                "right_leaning": "Right-leaning individuals may resonate with several of Chase Oliver's libertarian stances. His robust support for gun rights aligns well with conservative values on self-defense and individual liberties. Oliver's libertarian philosophy emphasizes reduced government intervention, which is likely to appeal to those favoring small government approaches. His stance on ending the war on drugs and supporting the legalization of marijuana, though potentially contentious, reflects a freedom-oriented viewpoint. Additionally, his approach to homelessness, focusing on removing regulatory barriers to aid the homeless, might be viewed as a market-based solution appealing to conservative principles."
            },
            "biography": {
                "birth_year": "1985",
                "birth_place": "Nashville, Tennessee",
                "education": [
                    "N/A"
                ]
            },
            "social_media": {
                "website": "N/A",
                "facebook": "N/A",
                "twitter": "N/A",
                "instagram": "N/A",
                "youtube": "N/A"
            }
        },
        {
            "name": "Dean Phillips",
            "slug": "dean-phillips",
            "withdrawn": false,
            "party": "Democratic",
            "current_position": "U.S. Representative for Minnesota",
            "announcement_date": "October 26, 2023",
            "past_roles": [
                {
                    "role": "President and CEO of Phillips Distilling Company",
                    "start_year": 1993,
                    "end_year": 2012
                },
                {
                    "role": "Executive Chairman of Talenti Gelato",
                    "start_year": 2012,
                    "end_year": 2016
                },
                {
                    "role": "Co-Founder of Penny's Coffee",
                    "start_year": 2016,
                    "end_year": "Present"
                },
                {
                    "role": "U.S. Representative for Minnesota's 3rd Congressional District",
                    "start_year": 2019,
                    "end_year": "Present"
                }
            ],
            "quote": "I didn’t set out to enter this race. But it looks like on our current course, the Democrats will lose and Trump will be our President again. ... This is a last-minute campaign, but desperate times call for desperate measures, and courage is an important value to me.",
            "key_legislation_or_accomplishments": [],
            "policy_perspectives": {
                "left_leaning": "Left-leaning individuals might empathize with Dean Phillips's concerns regarding President Biden's age and the need for younger, more dynamic leadership, especially given the significant number of Democrats sharing these concerns. While Phillips's focus on healthcare reform, fiscal responsibility, and climate change aligns with progressive priorities, his moderate and pro-business stance might not fully resonate with the more progressive wing of the Democratic Party.",
                "centrist": "Centrists may view Dean Phillips's candidacy favorably, appreciating his 'fiscally responsible, socially inclusive' approach that emphasizes bipartisan governance and pragmatic solutions. His criticism of non-competitive primaries and advocacy for new leadership could appeal to those disillusioned with partisan politics. Phillips's emphasis on campaign finance reform and creating bipartisan presidential Cabinets might be seen as positive steps toward reducing divisiveness in politics.",
                "right_leaning": "Right-leaning voters might appreciate Dean Phillips's pro-business policies, viewing them as beneficial for economic growth and stability. His challenge to Biden and critique of current Democratic leadership could be seen as a welcome diversity of thought within the Democratic Party. Phillips's willingness to question the competency of leaders in his party, including Vice President Kamala Harris, may be interpreted as a sign of independence. However, his late entry into the race and decision to skip the Nevada primary might be viewed as strategic missteps."
            },
            "key_policy_points": [
                "Bringing down the cost of living by being pro-worker and pro-business",
                "Improving community safety by addressing mental health and drug issues",
                "Investing in young people",
                "Making politics less divisive with policies like term limits and campaign finance reform"
            ],
            "biography": {
                "birth_year": 1969,
                "birth_place": "St. Paul, Minnesota",
                "education": [
                    "Bachelor's degree from Brown University",
                    "Master's degree in business from the University of Minnesota"
                ]
            },
            "social_media": {
                "website": "Not specified",
                "facebook": "Not specified",
                "twitter": "Not specified",
                "instagram": "Not specified",
                "youtube": "Not specified"
            }
        },
        {
            "name": "Marianne Williamson",
            "slug": "marianne-williamson",
            "withdrawn": false,
            "party": "Democratic",
            "current_position": "Author/Speaker",
            "announcement_date": "February 23, 2023",
            "past_roles": [
                {
                    "role": "Author",
                    "start_year": 1992,
                    "end_year": 2022
                }
            ],
            "quote": "Our deepest fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure.",
            "key_legislation_or_accomplishments": [],
            "key_policy_points": [
                "Universal Healthcare",
                "Climate Change",
                "Reparations"
            ],
            "policy_perspectives": {
                "left_leaning": "This candidate could be considered a strong advocate for progressive social and economic policies. Their stance on single-payer healthcare, reparations, and animal welfare resonate strongly with values often held by liberals. The emphasis on social justice, particularly in areas like criminal justice reform, disability rights, LGBTQIA+ rights, and Native American justice, underscores a comprehensive progressive agenda. Their economic policies, which discuss the need for an Economic Bill of Rights and criticize corporatization, would likely also be well-received by left-leaning individuals. Moreover, the candidate’s strong emphasis on climate action and peace-building might be seen as a fresh and urgently needed approach.",
                "centrist": "Centrists might find this candidate's platform to be a mixed bag. While the emphasis on child advocacy, education, and food safety could be universally appealing, the approach to issues like the economy and criminal justice may be considered too far-reaching or radical. Centrists might appreciate the focus on \"care economy\" and humane treatment of all individuals but may be skeptical of the feasibility or practicality of implementing single-payer healthcare or reparations. The candidate’s commitment to social justice is notable but could be viewed as overly idealistic or ambitious for centrists who often seek compromise and incremental change.",
                "right_leaning": "This candidate's policy points may raise several concerns. The emphasis on single-payer healthcare, reparations, and what could be considered 'big government' solutions might not sit well with conservative values, which generally favor smaller government and individual liberties. The stance on gun safety, framed as an emergency, might be seen as an attack on Second Amendment rights. Moreover, economic viewpoints that critique corporate interests and advocate for a \"care economy\" might be seen as antithetical to free-market principles. The approach to immigration, while compassionate, may also not align with more conservative views that emphasize border security."
            },
            "biography": {
                "birth_year": 1952,
                "birth_place": "Houston, Texas",
                "education": [
                    "Pomona College"
                ]
            },
            "social_media": {
                "website": "https://marianne.com/",
                "facebook": "williamsonmarianne",
                "twitter": "marwilliamson",
                "instagram": "mariannewilliamson",
                "youtube": "MarianneWilliamson"
            }
        },
        {
            "name": "Jill Stein",
            "slug": "jill-stein",
            "withdrawn": false,
            "party": "Green",
            "current_position": "Physician, Organizer, Environmental-Health Advocate",
            "announcement_date": "November 9, 2023",
            "past_roles": [
                {
                    "role": "2016 Green Party Presidential Candidate",
                    "start_year": 2016,
                    "end_year": 2016
                },
                {
                    "role": "2012 Green Party Presidential Candidate",
                    "start_year": 2012,
                    "end_year": 2012
                },
                {
                    "role": "Massachusetts Green-Rainbow Party Governor Candidate",
                    "start_year": 2002,
                    "end_year": 2002
                },
                {
                    "role": "Massachusetts Green-Rainbow Party State Representative Candidate",
                    "start_year": 2004,
                    "end_year": 2004
                },
                {
                    "role": "Massachusetts Secretary of State Candidate",
                    "start_year": 2006,
                    "end_year": 2006
                },
                {
                    "role": "Massachusetts Gubernatorial Candidate",
                    "start_year": 2010,
                    "end_year": 2010
                }
            ],
            "quote": "I'm running for president to offer a better choice for the people outside the failed two-party system. We'll put a pro-worker, anti-war, climate emergency agenda front and center in this election and on the ballot in November.",
            "key_legislation_or_accomplishments": [],
            "key_policy_points": [
                "Environmental Health",
                "Activism",
                "Campaign Finance Reform"
            ],
            "policy_perspectives": {
                "left_leaning": "Jill Stein, representing the Green Party, is often celebrated by left-leaning individuals for her staunch advocacy of environmental issues and her commitment to social justice. Her platform, which typically includes transitioning to 100% renewable energy, supporting universal healthcare, and reducing military spending, resonates with progressive voters seeking radical change from traditional Democratic policies. Stein's emphasis on grassroots activism and her criticism of corporate influence in politics aligns well with left-wing ideals of equality and sustainability. However, some on the far left may criticize her for not fully aligning with socialist principles or for her perceived impact on the Democratic vote in crucial elections.",
                "centrist": "From a centrist viewpoint, Jill Stein presents a mixed bag. Her focus on environmental issues and advocacy for healthcare reform are seen as positive, aligning with the general public's growing concern about climate change and healthcare accessibility. However, centrists often view her policy proposals as too radical or impractical, particularly her plans for a rapid shift to renewable energy and significant cuts in defense spending. Stein's criticism of both major parties can be appealing to those disenchanted with the current political system, but her perceived lack of experience in governance and pragmatic policy-making can be a concern for voters seeking a balanced approach.",
                "right_leaning": "Right-leaning individuals often view Jill Stein as too extreme and out of touch with mainstream American values. Her environmental policies are frequently seen as overreaching and potentially damaging to the economy, especially in sectors like fossil fuels and manufacturing. Stein's advocacy for large-scale social programs, such as universal healthcare and free college tuition, clashes with conservative principles of small government and fiscal responsibility. Additionally, her critical stance on U.S. military engagements and defense spending is often at odds with right-wing emphasis on national security and military strength."
            },
            "biography": {
                "birth_year": 1950,
                "birth_place": "Chicago, Illinois",
                "education": [
                    "Harvard College, BA in Social Relations, 1973",
                    "Harvard Medical School, MD, 1979"
                ]
            },
            "social_media": {
                "website": "N/A",
                "facebook": "N/A",
                "twitter": "N/A",
                "instagram": "N/A",
                "youtube": "N/A"
            }
        },
        {
            "name": "Doug Burgum",
            "slug": "doug-burgum",
            "withdrawn": false,
            "party": "Republican",
            "current_position": "Governor of North Dakota",
            "announcement_date": "2023-06-07",
            "election_date": "2024-11-05",
            "past_roles": [
                {
                    "role": "Founder, Great Plains Software",
                    "start_year": 1983,
                    "end_year": 2001
                },
                {
                    "role": "Senior Vice President, Microsoft",
                    "start_year": 2001,
                    "end_year": 2007
                },
                {
                    "role": "Governor of North Dakota",
                    "start_year": 2016,
                    "end_year": 2023
                }
            ],
            "quote": "We need someone in the White House with small-town values who understands how real Americans get up every morning to put food on the table.",
            "key_legislation_or_accomplishments": [
                "Re-election as Governor in 2020"
            ],
            "key_policy_points": [
                "Cut taxes",
                "Reduce inflation and cost of living",
                "Increase domestic energy production"
            ],
            "policy_perspectives": {
                "right_leaning": "From a conservative viewpoint, Doug Burgum's policies on tax cuts and reduced government spending are likely to resonate well. His emphasis on domestic energy production aligns with nationalistic ideals and economic self-sufficiency. Burgum's decentralization policies for healthcare and education could be seen as empowering local communities and reducing federal overreach. His background in both business and governance may make him an appealing candidate for those who value practical experience in leadership roles.",
                "centrist": "Burgum's policy priorities of cutting taxes and focusing on the economy could appeal to a wide swath of voters, including centrists who are concerned about fiscal responsibility. His background as a successful entrepreneur and governor of a small-population state gives him a unique, practical perspective on governance. While he advocates for less federal involvement in sectors like healthcare and education, his re-election as Governor suggests a degree of bipartisan appeal.",
                "left_leaning": "Doug Burgum appears to be a traditional conservative, advocating for tax cuts and reduced government intervention—stances often criticized by progressives as benefiting the wealthy at the expense of social welfare programs. His emphasis on increasing domestic energy production may raise environmental concerns, particularly if it involves fossil fuels. Burgum's views on healthcare and education seem to favor decentralization, which critics argue could lead to inequality in service provision."
            },
            "biography": {
                "birth_year": 1956,
                "birth_place": "Arthur, North Dakota",
                "education": [
                    "North Dakota State University, Bachelors",
                    "Stanford University, MBA"
                ]
            },
            "social_media": {
                "website": "N/A",
                "facebook": "N/A",
                "twitter": "N/A",
                "instagram": "N/A",
                "youtube": "N/A"
            }
        },
        {
            "name": "Ron DeSantis",
            "slug": "ron-desantis",
            "withdrawn": false,
            "party": "Republican",
            "current_position": "Governor of Florida",
            "announcement_date": "May 24, 2023",
            "past_roles": [
                {
                    "role": "U.S. Navy Officer",
                    "start_year": 2004,
                    "end_year": 2010
                },
                {
                    "role": "U.S. House of Representatives",
                    "start_year": 2012,
                    "end_year": 2018
                }
            ],
            "quote": "Our border is a disaster, crime infests our cities, the federal government makes it harder for families to make ends meet, and the president flounders. But decline is a choice, success is attainable, and freedom is worth fighting for.",
            "key_legislation_or_accomplishments": [
                "Legislation 1",
                "Legislation 2"
            ],
            "running_mate_2024": "To be determined",
            "key_policy_points": [
                "Reduce government spending and inflation",
                "Increase security at the U.S.-Mexico border",
                "Support funding for law enforcement",
                "Increase domestic energy production",
                "Reduce the authority of the administrative state",
                "Re-establish integrity in our institutions"
            ],
            "policy_perspectives": {
                "left_leaning": "The candidate's policy agenda leans heavily conservative and seems disconnected from the needs of vulnerable populations. The focus on deregulation and economic freedom might exacerbate income inequality and favor corporations over workers. Their immigration stance appears exclusionary and sidesteps the humanitarian aspects of the issue. Their aggressive approach to combatting cartels is a potentially militaristic solution to a complex problem that also requires social and economic interventions.",
                "centrist": "The candidate has a mixed bag of policies that could attract a wide range of voters, depending on the details. The commitment to economic growth and the desire to reduce federal spending could appeal to fiscal conservatives and some moderates, but the lack of details raises questions. Their strong focus on border security could resonate with those concerned about national security, but more information is needed on how this will be balanced against trade, economic factors, and humanitarian concerns. Their comprehensive plan to fight cartels is commendable but raises questions about diplomatic relations.",
                "right_leaning": "This candidate shows strong leadership with a clear vision for restoring American prosperity and security. Their commitment to economic freedom and limited government aligns closely with conservative principles. The candidate's tough stance on immigration reform, border security, and dealing with cartels suggests a decisive approach to tackling these issues. The focus on military readiness and opposition to \"woke\" agendas within the armed forces would likely be viewed as a welcome return to core values."
            },
            "biography": {
                "birth_year": 1978,
                "birth_place": "Jacksonville, Fla.",
                "education": [
                    "Yale University",
                    "Harvard Law School"
                ]
            },
            "social_media": {
                "website": "Website Here",
                "facebook": "Facebook Here",
                "twitter": "Twitter Here",
                "instagram": "Instagram Here",
                "youtube": "YouTube Here"
            }
        },
        {
            "name": "Asa Hutchinson",
            "slug": "asa-hutchinson",
            "withdrawn": false,
            "party": "Republican",
            "current_position": "Running for President of the United States",
            "announcement_date": "April 2, 2023",
            "past_roles": [
                {
                    "role": "Governor of Arkansas",
                    "start_year": 2015,
                    "end_year": 2023
                },
                {
                    "role": "U.S. Representative for Arkansas' 3rd Congressional District",
                    "start_year": 1997,
                    "end_year": 2001
                },
                {
                    "role": "Undersecretary for Border and Transportation Security, U.S. Department of Homeland Security",
                    "start_year": 2003,
                    "end_year": 2005
                },
                {
                    "role": "Director of the Drug Enforcement Administration",
                    "start_year": 2001,
                    "end_year": 2003
                }
            ],
            "quote": "N/A",
            "key_legislation_or_accomplishments": [
                "N/A"
            ],
            "running_mate_2024": "N/A",
            "key_policy_points": [
                "Tax Cut",
                "Government Transformation",
                "Teacher Pay",
                "Ethics Reform",
                "Infrastructure"
            ],
            "policy_perspectives": {
                "left_leaning": "From a left-leaning perspective, Asa Hutchinson may be seen as a traditional Republican with stances that prioritize conservative fiscal policies, such as tax cuts, over social welfare programs. His plans to continue tax cuts might be criticized for benefiting the wealthy at the expense of crucial social services. His government transformation initiatives might be seen as a guise for reducing the scope and efficacy of government, which could harm vulnerable populations. While his proposal to raise teacher salaries is a positive step, it may not be seen as going far enough to address the systemic issues facing education. Ethics and infrastructure plans may be lauded, but could also be seen as relatively safe issues that don't address deeper structural inequalities.",
                "centrist": "Asa Hutchinson may appeal to centrists as a pragmatic politician who focuses on good governance, fiscal responsibility, and ethical integrity. His tax policies aim to simplify the tax code and increase fairness, while his plan to streamline government could make it more efficient and cost-effective. The proposal to raise teacher pay and invest in infrastructure are broadly popular initiatives that many can get behind, regardless of political leaning. His focus on ethics reform might be seen as a nod to restoring faith in public institutions, a concern shared by many Americans.",
                "right_leaning": "From a right-leaning viewpoint, Hutchinson could be seen as a strong candidate who aligns well with conservative values, particularly with his emphasis on tax cuts and small government. His plan to simplify the tax code and reduce the number of agencies reporting to the governor aligns with the conservative principles of lower taxes and less bureaucracy. His focus on ethics reform might be welcomed as a way to 'drain the swamp,' while his plans for teacher pay and infrastructure might be seen as targeted and fiscally responsible approaches to solving real-world issues, rather than expanding government reach."
            },
            "biography": {
                "birth_year": 1950,
                "birth_place": "Bentonville, Arkansas",
                "education": [
                    "B.S. in accounting from Bob Jones University, 1972",
                    "J.D. from the University of Arkansas School of Law, 1975"
                ]
            },
            "social_media": {
                "website": "N/A",
                "facebook": "N/A",
                "twitter": "N/A",
                "instagram": "N/A",
                "youtube": "N/A"
            }
        },
        {
            "name": "William Hurd",
            "slug": "william-hurd",
            "withdrawn": true,
            "party": "Republican",
            "current_position": "Running for President of the United States",
            "announcement_date": "June 22, 2023",
            "past_roles": [
                {
                    "role": "U.S. Representative for Texas' 23rd Congressional District",
                    "start_year": 2015,
                    "end_year": 2021
                },
                {
                    "role": "Central Intelligence Agency Officer",
                    "start_year": 2000,
                    "end_year": 2009
                }
            ],
            "quote": "N/A",
            "key_legislation_or_accomplishments": [
                "N/A"
            ],
            "running_mate_2024": "N/A",
            "key_policy_points": [
                "Border Security",
                "Immigration",
                "National Security",
                "Trade",
                "Economy & Taxes",
                "Veterans",
                "Education"
            ],
            "policy_perspectives": {
                "left_leaning": "Will Hurd's policies may appear to some as more moderate than those of other Republicans, particularly on issues like immigration and border security. However, critics on the left might argue that his approach still falls short of comprehensive immigration reform and doesn't adequately address social justice concerns. His focus on intelligence-led border security might be seen as a softer but still problematic alternative to a border wall. On the economy, his tax policies and deregulatory measures may be perceived as benefiting corporations and the wealthy at the expense of middle and working-class families. His stance on veterans and education, while laudable, doesn't fundamentally challenge the issues these sectors face, such as a lack of adequate funding or systemic inequality.",
                "centrist": "Will Hurd presents himself as a pragmatic and solutions-oriented candidate, focusing on bipartisan efforts and practicality. His intelligence background lends him credibility on national security issues, and his moderate stance on immigration could appeal to voters who are looking for a balanced approach. In terms of trade and the economy, Hurd is pro-business but also emphasizes the importance of international partnerships, something centrists may find appealing. His focus on veterans and education seems aimed at creating practical solutions to ongoing problems rather than ideological stances.",
                "right_leaning": "Conservatives might appreciate Will Hurd's commitment to national security, drawing from his CIA experience. His approach to border security, although not as hardline as some would prefer, emphasizes effectiveness and the use of technology, which can be seen as a rational approach to a complex problem. Hurd's economic policies are in line with traditional Republican values like low taxes and deregulation, aimed at fostering business growth and individual prosperity. However, some conservatives might question his willingness to work across the aisle on issues like immigration, seeing it as a compromise on conservative principles."
            },
            "biography": {
                "birth_year": "1977",
                "birth_place": "San Antonio, Texas",
                "education": [
                    "B.S. from Texas A&M University"
                ]
            },
            "social_media": {
                "website": "N/A",
                "facebook": "N/A",
                "twitter": "N/A",
                "instagram": "N/A",
                "youtube": "N/A"
            }
        },
        {
            "name": "Larry Elder",
            "slug": "larry-elder",
            "withdrawn": true,
            "party": "Republican",
            "current_position": "Talk Radio Host",
            "announcement_date": "April 20, 2023",
            "past_roles": [
                {
                    "role": "Talk Radio Host",
                    "start_year": 1994,
                    "end_year": 2022
                },
                {
                    "role": "Lawyer in Private Practice",
                    "start_year": 1970,
                    "end_year": 1980
                }
            ],
            "quote": "America is in decline, but this decline is not inevitable. It is a choice made by detached and cynical politicians. As a California resident, I’ve seen firsthand how decades of Democrat rule have turned the Golden State, for many, into an unaffordable dystopia. I won’t let them do the same to America. We can enter a new American Golden Age, but we must choose a leader who can bring us there. That’s why I’m running for President.",
            "key_legislation_or_accomplishments": [
                "N/A"
            ],
            "running_mate_2024": "N/A",
            "key_policy_points": [
                "Support for Law Enforcement",
                "Increasing Security at U.S.-Mexico Border",
                "Producing More Energy in America"
            ],
            "policy_perspectives": {
                "left_leaning": "From a left-leaning perspective, Larry Elder represents a regressive approach to America's problems, with policies that could exacerbate social and economic inequality. His support for law enforcement and opposition to social welfare programs may come across as lacking compassion for marginalized communities. His focus on \"personal responsibility\" may ignore systemic issues that create obstacles for certain groups. Moreover, his skepticism about systemic racism and his opposition to CRT (Critical Race Theory) could be viewed as an attempt to overlook or diminish the very real challenges tied to racial inequity in America.",
                "centrist": "Larry Elder is a highly polarizing figure whose policies appeal to a specific ideological base. While his fiscal conservatism might be attractive to some, his views on social issues, systemic racism, and welfare could alienate many moderates. Elder's emphasis on law and order might resonate with those concerned about crime rates, but his stances seem to lack nuance. His experience in media and law could be seen as valuable or as a limitation, given the lack of legislative or executive governance on his resume.",
                "right_leaning": "From a right-leaning viewpoint, Larry Elder is a strong candidate who focuses on key conservative issues like individual liberty, national security, and economic growth. His commitment to law enforcement, school choice, and anti-welfare sentiments might be viewed as much-needed common sense in an era of left-leaning social policies. Elder's stance against Critical Race Theory is likely seen as a defense of traditional American values. His focus on containing China and securing the U.S.-Mexico border speaks to those who are concerned about America's standing and security on the global stage."
            },
            "biography": {
                "birth_year": 1952,
                "birth_place": "Los Angeles, California",
                "education": [
                    "Bachelor's degree in Political Science from Brown University",
                    "Law degree from the University of Michigan School of Law"
                ]
            },
            "social_media": {
                "website": "N/A",
                "facebook": "N/A",
                "twitter": "N/A",
                "instagram": "N/A",
                "youtube": "N/A"
            }
        },
        {
            "name": "Ryan Binkley",
            "slug": "ryan-binkley",
            "withdrawn": false,
            "party": "Republican",
            "current_position": "Businessman and Pastor",
            "announcement_date": "4/23/23",
            "past_roles": [
                {
                    "role": "President and Chief Executive Officer at Generational Group",
                    "start_year": 2005,
                    "end_year": 2023
                },
                {
                    "role": "Employee at Proctor & Gamble",
                    "start_year": null,
                    "end_year": null
                },
                {
                    "role": "Employee at Boston Scientific Corporation",
                    "start_year": null,
                    "end_year": null
                }
            ],
            "quote": "The problems we face, and the blame we lay, can all be rectified if we look to God, find the good in our fellow Americans, and resolve to trust each other one more time.",
            "key_legislation_or_accomplishments": [],
            "running_mate_2024": null,
            "key_policy_points": [
                "Reducing national debt",
                "Reducing healthcare costs",
                "Addressing immigration",
                "Increasing community involvement in education",
                "Unity"
            ],
            "policy_perspectives": {
                "centrist": "From a centrist viewpoint, Ryan Binkley may offer some appealing aspects. His emphasis on unity and bipartisan solutions could resonate with voters tired of political polarization. His background in business may indicate a pragmatic approach to economic issues, while his pastoral work suggests a moral compass that could guide his policy decisions. However, centrists might want to see more specifics on how he plans to accomplish his broad goals, like healthcare reform and debt reduction.",
                "left_leaning": "Ryan Binkley's policies may not sit well with left-leaning voters, particularly given his focus on reducing federal spending to tackle the national debt and his desire to increase border security. His stance on promoting a \"culture of life\" is likely to be interpreted as anti-abortion, which is generally contrary to left-wing ideologies. Furthermore, Binkley's focus on religious themes and unity through God may raise church-state separation concerns for some progressive voters.",
                "right_leaning": "Right-leaning voters are likely to find Binkley's policies appealing. His focus on reducing the national debt, lowering healthcare costs, and enhancing border security aligns well with conservative economic and security concerns. His religious background and emphasis on community involvement in education could resonate well with socially conservative voters. The candidate's commitment to an \"All of the Above\" energy strategy may also attract those who support American energy independence."
            },
            "biography": {
                "birth_year": 1967,
                "birth_place": "Columbus, Georgia",
                "education": [
                    "Bachelor's degree in Finance and Marketing from Texas McCombs School of Business, 1990",
                    "Master's degree in Business Administration and Management from Southern Methodist University, 2005"
                ]
            },
            "social_media": {
                "website": "www.google.com",
                "facebook": null,
                "twitter": null,
                "instagram": null,
                "youtube": null
            }
        },
        {
            "name": "Chris Christie",
            "slug": "chris-christie",
            "withdrawn": false,
            "party": "Republican",
            "current_position": "Former Governor of New Jersey",
            "announcement_date": "June 6, 2023",
            "past_roles": [
                {
                    "role": "Governor of New Jersey",
                    "start_year": 2010,
                    "end_year": 2018
                },
                {
                    "role": "U.S. Attorney for New Jersey",
                    "start_year": 2002,
                    "end_year": 2009
                }
            ],
            "quote": "I’m running for President of the United States because the truth still matters. We need leaders that are willing to stand up and tell it like it is.",
            "key_legislation_or_accomplishments": [],
            "running_mate_2024": "",
            "key_policy_points": [
                "Criticism of former President Donald Trump",
                "Leadership and telling the truth"
            ],
            "policy_perspectives": {
                "centrist": "Chris Christie seems to be positioning himself as a reasonable conservative, emphasizing truth and leadership. His vocal criticism of Donald Trump indicates a willingness to stand against prevailing winds within his party, which might resonate with voters who are disenchanted with extreme partisanship. However, his track record as Governor of New Jersey shows him to be a mostly traditional conservative, meaning centrists should weigh his more moderate rhetoric against his actual policy history.",
                "left_leaning": "Chris Christie presents himself as a critic of Donald Trump, but progressive voters should not forget his conservative tenure as Governor of New Jersey. His focus on \"the truth\" might seem like a nod to bipartisanship, but his previous policy decisions and political stances, including his endorsement of Trump in 2016, suggest a more complex picture. Left-leaning voters might find his criticism of Trump appealing but insufficient for building a broad-based coalition for change.",
                "right_leaning": "While Chris Christie criticizes Donald Trump, it's essential to remember that he has a robust conservative background, including his time as Governor of New Jersey. He has experience in leadership roles and is not a newcomer to the national stage. His anti-Trump stance could be seen as a strategic differentiation in a crowded field or as a genuine concern for the direction of the party. However, his criticism of a still-popular figure in Republican circles might alienate core GOP voters."
            },
            "biography": {
                "birth_year": 1962,
                "birth_place": "Newark, New Jersey",
                "education": [
                    "Political Science Undergraduate",
                    "J.D. in Law"
                ]
            },
            "social_media": {
                "website": "",
                "facebook": "",
                "twitter": "",
                "instagram": "",
                "youtube": ""
            }
        },
        {
            "name": "Cornel West",
            "slug": "cornel-west",
            "withdrawn": false,
            "party": "Green",
            "current_position": "Philosopher/Political Activist/Social critic",
            "announcement_date": "June 5, 2023",
            "past_roles": [
                {
                    "role": "Assistant Professor at Union Theological Seminary",
                    "start_year": 1980,
                    "end_year": 1982
                },
                {
                    "role": "Professor at various universities including Harvard, Yale, Princeton",
                    "start_year": 1980,
                    "end_year": 2021
                },
                {
                    "role": "Honorary Chairman of the Democratic Socialists of America",
                    "start_year": 2000,
                    "end_year": 2001
                }
            ],
            "quote": "You can’t lead the people if you don’t love the people. You can’t save the people if you don’t serve the people.",
            "key_legislation_or_accomplishments": [
                "Published 20 books including 'Race Matters', 'Democracy Matters: Winning the Fight Against Imperialism', 'Black Prophetic Fire'"
            ],
            "running_mate_2024": "",
            "key_policy_points": [
                "Issues of race, class, and justice",
                "Democratic socialism",
                "Christian moral sensibility",
                "American pragmatism"
            ],
            "policy_perspectives": {
                "left_leaning": "Cornel West, as a self-identified socialist, aligns closely with several key priorities of the left. His campaign's emphasis on Medicare for All, public housing, and action on climate change resonates with progressive values. Additionally, his stance on drastically cutting the U.S. military budget and supporting policies like the Green New Deal might be particularly appealing to left-leaning voters seeking bold reforms and a strong focus on social justice and environmental issues​​.",
                "centrist": "Centrists might view West's candidacy with mixed feelings. While his support for campaign finance reform and voting rights aligns with broader democratic principles, his more radical proposals, like universal public housing and a significant reduction in military spending, might be seen as too extreme. Centrists often seek balanced, moderate solutions and may find West's approach too far removed from mainstream Democratic policies. However, his agreement with Biden on certain issues like climate change action and access to preschool and child care might find some resonance among centrist voters​​.",
                "right_leaning": "Right-leaning voters are likely to find West's political positions largely at odds with their views. His socialist stances, such as support for Medicare for All and the Green New Deal, along with his opposition to new oil drilling, are in direct conflict with conservative economic and energy policies. Additionally, his criticism of U.S. foreign aid and military policy, along with his perspective that the Democratic Party does not 'deserve anybody's vote,' places him firmly outside the typical right-leaning ideological sphere. His potential impact on reducing both Biden's and Trump's support in the general election might be of interest, highlighting his role as a potential spoiler in the electoral process​​."
            },
            "biography": {
                "birth_year": 1953,
                "birth_place": "Tulsa, Oklahoma",
                "education": [
                    "B.A. in Middle Eastern Languages and Literature from Harvard University",
                    "M.A. and Ph.D. in Philosophy from Princeton University"
                ]
            },
            "social_media": {
                "website": "",
                "facebook": "",
                "twitter": "",
                "instagram": "",
                "youtube": ""
            }
        },
        {
            "name": "Perry Johnson",
            "slug": "perry-johnson",
            "withdrawn": true,
            "party": "Republican",
            "current_position": "Businessman and Author",
            "announcement_date": "March 2, 2023",
            "past_roles": [
                {
                    "role": "Businessman and Author",
                    "start_year": "N/A",
                    "end_year": "N/A"
                }
            ],
            "quote": "I'm a guy that started with nothing, & ended up with the most perfect life on the planet. I lived the American dream, & I want to keep that American dream alive. To do that, obviously, we need to change things.",
            "key_legislation_or_accomplishments": [
                "N/A"
            ],
            "running_mate_2024": "N/A",
            "key_policy_points": [
                "Two-Cents Plan",
                "Inflation",
                "Energy",
                "Border Security",
                "Fentanyl Crisis",
                "Social Security & Medicare",
                "Simplifying the Tax Code",
                "National Security",
                "Education",
                "Department of Justice & FBI"
            ],
            "policy_perspectives": {
                "left_leaning": "Individuals with a left-leaning perspective may strongly disagree with Perry Johnson's campaign, particularly on issues like border security and fiscal conservatism. They may argue that Johnson's focus on reducing government spending and implementing austerity measures might lead to cutbacks in social programs that many Americans rely on. Furthermore, they might consider his emphasis on \"pro-life, pro-second amendment\" values as exclusionary and not aligned with progressive social values. His approach to energy, particularly his support for fossil fuels, could also be viewed as an environmental concern. Overall, those on the left may believe that Johnson's policies lack empathy and adequate consideration for social justice and climate change.",
                "centrist": "From a centrist perspective, Perry Johnson could be seen as someone who brings a pragmatic blend of policies to the table. His focus on fiscal responsibility, reducing the deficit, and controlling inflation could be interpreted as a balanced approach to economic stability. However, his willingness to continue using fossil fuels might be seen as a practical middle ground between rapid climate action and economic considerations. Centrists may appreciate that he acknowledges the challenges at the southern border, but they might hope that he pairs this with a humane immigration policy. Overall, centrists might see Johnson as someone who combines elements of both conservative and liberal policies, although some may question if he leans too far to the right to truly be considered centrist.",
                "right_leaning": "Supporters from the right are likely to appreciate Perry Johnson's focus on traditional conservative values, such as limited government, strong national security, and personal freedoms. His \"Two Cents Plan\" and his goal to simplify the tax code would resonate well with those who prioritize fiscal conservatism. Additionally, his pro-life and pro-second amendment stances would likely garner strong support from social conservatives. His policies on border security and national debt may also appeal to those concerned about American sovereignty and fiscal health. Overall, his platform would probably be seen as a strong representation of conservative values and aims to restore what some on the right may consider \"common-sense governance.\""
            },
            "biography": {
                "birth_year": "N/A",
                "birth_place": "Dolton, Illinois",
                "education": [
                    "Bachelor's degree in mathematics from the University of Illinois at Urbana-Champaign"
                ]
            },
            "social_media": {
                "website": "N/A",
                "facebook": "N/A",
                "twitter": "N/A",
                "instagram": "N/A",
                "youtube": "N/A"
            }
        },
        {
            "name": "Robert F. Kennedy Jr.",
            "slug": "robert-f-kennedy-jr",
            "withdrawn": false,
            "party": "Independent",
            "current_position": "Author and Lawyer",
            "announcement_date": "April 5, 2023",
            "past_roles": [
                {
                    "role": "Assistant District Attorney",
                    "start_year": 1982,
                    "end_year": 1983
                },
                {
                    "role": "Chief Attorney at Riverkeeper",
                    "start_year": 1985,
                    "end_year": 1987
                },
                {
                    "role": "Chairman and Attorney at Waterkeeper Alliance",
                    "start_year": 1999,
                    "end_year": 2017
                }
            ],
            "quote": "We will scale down the war machine and bring our resources home. We will rebuild our water systems, repair our roads, modernize our railroads, and clean up our environment...",
            "key_legislation_or_accomplishments": [],
            "key_policy_points": [
                "Increased government transparency and whistleblower protection",
                "Curb lobbying and the 'revolving door' between government and industry",
                "Address polarization and foster dialogue",
                "Transition to clean energy and preserve wild lands",
                "Economic revitalization focusing on small and medium businesses",
                "Transition from 'sick care' to 'wellness society'",
                "End American militaristic policies abroad",
                "Restore rights and liberties as outlined in the Bill of Rights"
            ],
            "policy_perspectives": {
                "left_leaning": "Left-leaning individuals might find Kennedy's advocacy for certain liberal policies appealing, such as his support for small and medium businesses and his criticism of corporate power in the U.S. political economy. However, his stance on a national ban on abortion after the first trimester and opposition to nationalizing the pharmaceutical industry may not align with more progressive views. His controversial claims regarding vaccines and COVID-19, along with his conspiracy theories, are likely to be a significant point of contention for left-leaning voters​​.",
                "centrist": "Centrists may appreciate Kennedy's call for ending 'the corrupt merger of state and corporate power' and his foreign policy stance focused on reducing military interventions. However, his position on gun control, being a constitutional absolutist, might resonate with those seeking a balance between Second Amendment rights and public safety. Centrists might also find his varied political views, ranging from liberal to conservative and libertarian, as an opportunity for a more diverse political discourse, but his involvement in conspiracy theories could be a major concern​​.",
                "right_leaning": "Right-leaning individuals might find common ground with Kennedy on issues like gun rights and opposition to a Medicare for All system. His criticism of the Democratic Party as 'the party of war' and his advocacy for a single-payer healthcare system that allows private options could appeal to conservatives seeking alternatives to mainstream Republican policies. However, his controversial statements on vaccines, COVID-19, and other conspiracy theories might be divisive even among right-leaning voters. The support he has received from certain Republicans and his criticism of state and corporate power might also be of interest​​."
            },
            "biography": {
                "birth_year": 1954,
                "birth_place": "Washington, D.C.",
                "education": [
                    "B.A. in American History and Literature from Harvard University",
                    "Law Degree from the University of Virginia",
                    "Master's Degree in Environmental Law from Pace University"
                ]
            },
            "social_media": {
                "website": "",
                "facebook": "",
                "twitter": "",
                "instagram": "",
                "youtube": ""
            }
        },
        {
            "name": "Joe Biden",
            "slug": "joe-biden",
            "withdrawn": false,
            "party": "Democratic",
            "current_position": "46th president of the United States",
            "announcement_date": "April 25, 2023",
            "past_roles": [
                {
                    "role": "Representative for Delaware in the U.S. Senate",
                    "start_year": 1973,
                    "end_year": 2009
                },
                {
                    "role": "Vice president under President Barack Obama",
                    "start_year": 2009,
                    "end_year": 2017
                }
            ],
            "quote": "I know America. I know we're good and decent people. I know we're still a country that believes in honesty and respect, and treating each other with dignity... And this is our moment.",
            "key_legislation_or_accomplishments": [
                "Infrastructure Investment and Jobs Act of 2021",
                "United States Chips and Science Act",
                "Inflation Reduction Act of 2022"
            ],
            "running_mate_2024": "U.S. Sen. Kamala Harris (D)",
            "key_policy_points": [
                "Make childcare and elder care more accessible",
                "Protect Social Security and Medicare",
                "Enact a minimum tax for billionaires",
                "Codify the right to abortion",
                "Ban assault weapons",
                "Support voting rights"
            ],
            "policy_perspectives": {
                "left_leaning": "President Joe Biden's re-election platform strongly aligns with progressive values. He is committed to protecting Social Security and Medicare, ensuring that the rich pay their fair share in taxes, and guaranteeing reproductive rights for women, all central tenets of left-leaning philosophy. His proposed ban on assault weapons reflects a necessary response to the current crisis of gun violence. Additionally, Biden's support for climate action and renewable energy investment reflects his alignment with progressive stances on environmental sustainability.",
                "centrist": "Biden's platform presents a balanced approach that marries progressive ideas with pragmatic policy-making. His commitment to make childcare and elder care more accessible to all Americans is not only socially progressive but also economically sound, and his determination to protect Social Security and Medicare is a testament to his commitment to the well-being of all citizens. His pledge to enact a minimum tax for billionaires signifies a fair tax system. His stance on gun control, while contentious, acknowledges the need for reform amidst increasing gun violence. The focus on manufacturing and job creation is in line with moderate economic principles, supporting both business and worker interests.",
                "right_leaning": "From a conservative standpoint, Biden's platform might raise concerns about potential overreach in economic and social policy. His plan to impose a minimum tax on billionaires could be seen as detrimental to economic growth and potentially discouraging for entrepreneurs and investors. The proposed ban on assault weapons may be viewed as an infringement on Second Amendment rights. Also, his stance on abortion rights contradicts the pro-life views held by many conservatives. While his commitment to job creation is laudable, concerns may arise over the potential costs and regulations associated with his environmental policies."
            },
            "biography": {
                "birth_year": 1942,
                "birth_place": "Scranton, Pennsylvania",
                "education": [
                    "University of Delaware with a degree in history and political science",
                    "Law degree from the Syracuse University Law School"
                ]
            },
            "social_media": {
                "website": "Joe Biden's campaign website",
                "facebook": "Joe Biden on Facebook",
                "twitter": "Joe Biden on Twitter",
                "instagram": "Joe Biden on Instagram",
                "youtube": "Joe Biden on YouTube"
            }
        },
        {
            "name": "Mike Pence",
            "slug": "mike-pence",
            "withdrawn": true,
            "party": "Republican",
            "current_position": "Former Vice President of the United States",
            "announcement_date": "June 5, 2023",
            "past_roles": [
                {
                    "role": "Governor of Indiana",
                    "start_year": 2013,
                    "end_year": 2017
                },
                {
                    "role": "Representative in the U.S. House of Representatives",
                    "start_year": 2001,
                    "end_year": 2013
                }
            ],
            "quote": "I know we can bring this country back. We can defend our Nation and secure our border. We can revive our economy. We can put our Nation back on a path to a balanced federal budget. We can defend our liberties and give America a new beginning for life.",
            "key_legislation_or_accomplishments": [],
            "key_policy_points": [
                "Reduce federal spending and combat inflation",
                "Achieve American energy independence and dominance",
                "Restore power to states and local jurisdictions",
                "Reinstate the Remain in Mexico policy and secure the border",
                "Ensure U.S. military dominance and rebuild the Navy",
                "Protect traditional family values and oppose abortion"
            ],
            "policy_perspectives": {
                "left_leaning": "Mike Pence's 2024 presidential campaign is concerning from a progressive standpoint due to his staunch conservative stances, particularly on social issues. His strong anti-abortion stance, including support for a constitutional amendment to enshrine the right to life, directly opposes the left's advocacy for reproductive rights. Pence's policies on energy, which focus heavily on fossil fuels and energy independence, are seen as a step back from necessary climate change action. His emphasis on traditional family values and opposition to gender reassignment procedures may be viewed as a regression in the fight for LGBTQ+ rights. Furthermore, his plans to reduce federal spending and limit government intervention are at odds with the left's call for more government involvement in social programs and healthcare.",
                "centrist": "From a centrist viewpoint, Mike Pence presents a mixed bag as a 2024 presidential candidate. His experience as vice president and a long-time public servant give him a deep understanding of the political landscape. His focus on fiscal responsibility and reducing government debt could appeal to moderate voters who prioritize economic stability. However, his hardline stances on social issues like abortion and LGBTQ+ rights might not resonate with centrists who prefer more moderate or progressive social policies. His energy policies, while promoting American independence and economic growth, might lack the balance centrists seek in addressing environmental concerns. Pence’s stance on border security and immigration, including the reinstatement of the Remain in Mexico policy, might appeal to centrists concerned with national security, though his approach could be seen as too stringent.",
                "right_leaning": "For right-leaning individuals, Mike Pence's candidacy in the 2024 presidential race is highly favorable. His conservative track record, especially his vice-presidency under Donald Trump, aligns well with the right's values. His strong stance on issues like abortion, religious freedom, and traditional family values resonates deeply with the conservative base. Pence's commitment to American energy dominance and his criticism of the Biden administration's energy policies align with right-leaning priorities for economic growth and national independence. His focus on border security and strict immigration policies, including the completion of the border wall, are key issues for the right. Additionally, his approach to federalism, advocating for states' rights and reducing federal government overreach, is a fundamental conservative principle. Pence's fiscal conservatism, aiming to reduce government spending and debt, is also a critical point for right-leaning voters."
            },
            "biography": {
                "birth_year": 1959,
                "birth_place": "Columbus, Indiana",
                "education": [
                    "Bachelor's degree in history from Hanover College",
                    "J.D. from Indiana University School of Law"
                ]
            },
            "social_media": {
                "website": "",
                "facebook": "",
                "twitter": "",
                "instagram": "",
                "youtube": ""
            }
        },
        {
            "name": "Donald Trump",
            "slug": "donald-trump",
            "withdrawn": false,
            "party": "Republican",
            "current_position": "45th President of the United States",
            "election_date": "2024",
            "announcement_date": "November 15, 2022",
            "past_roles": [
                {
                    "role": "45th President of the United States",
                    "start_year": 2017,
                    "end_year": 2021
                },
                {
                    "role": "Executive Producer of The Apprentice",
                    "start_year": 2004,
                    "end_year": 2015
                },
                {
                    "role": "Reform Party Presidential Candidate",
                    "start_year": 1999,
                    "end_year": 2000
                }
            ],
            "quote": "America's comeback starts right now. When I left office, the United States stood ready for its golden age. [...] Now we are a nation in decline. We are a failing nation. For millions of Americans, the past two years under Joe Biden have been a time of pain, hardship, anxiety, and despair.",
            "key_legislation_or_accomplishments": [
                "United States withdrawing from the Iran nuclear deal",
                "Passage of the Tax Cuts and Jobs Act of 2017",
                "First Step Act in 2018",
                "Reducing the size of the ISIS caliphate",
                "Establishing the Space Force as an independent military branch",
                "More than 200 federal judicial appointments, including three U.S. Supreme Court justices"
            ],
            "running_mate_2024": "Not specified",
            "key_policy_points": [
                "Rebuild the Greatest Economy in History",
                "Fair Trade for the American Worker",
                "Unleash Energy Dominance",
                "Secure Borders and Reclaim National Sovereignty",
                "War on the Drug Cartels",
                "Stop Crime and Restore Safety",
                "Renew American Strength and Leadership",
                "Reject Globalism and Embrace Patriotism",
                "Care For Our Veterans",
                "Protect Parents’ Rights",
                "Defend Law and Liberty",
                "End Censorship and Reclaim Free Speech",
                "Free, Honest and Lawful Elections",
                "Drain the Swamp of Washington Corruption",
                "Better Health Care Choices at Lower Costs"
            ],
            "policy_perspectives": {
                "left_leaning": "Donald Trump's policies disproportionately favor wealthy individuals and corporations over average Americans. His tax cuts primarily benefited the top income brackets, and deregulation often led to the erosion of workers' rights and environmental safeguards. His approach to trade wars and tariffs lacked nuance, causing harm to the American consumer and farmers. Trump's immigration and border policies were often criticized as inhumane and xenophobic. His stance on law and order was perceived as disproportionately harsh, particularly on marginalized communities, without adequately addressing the root causes of crime or offering reformative solutions. His foreign policies often distanced allies and his approach to climate change was considered regressive.",
                "centrist": "Donald Trump's administration had a mixed bag of successes and failures. He made significant strides in economic growth pre-COVID-19, but his methods were often contentious. His tax cuts did help stimulate the economy, yet they also increased the federal deficit. Trump was willing to challenge traditional trade agreements and confront China on unfair practices, but this led to volatile relations and uncertainties. On immigration, he prioritized border security but failed to propose comprehensive immigration reform. His focus on law and order appealed to some but also stirred controversies around racial profiling and police brutality. Trump's approach to foreign policy was unconventional; he engaged with North Korea and made peace deals in the Middle East but often at the cost of straining relations with long-time allies.",
                "right_leaning": "Donald Trump was an effective leader who unapologetically prioritized American interests. His tax cuts and deregulation policies revived the American economy, resulting in historically low unemployment rates for various demographic groups. Trump's aggressive trade policies were a long-overdue response to years of exploitation by other nations. His stance on immigration and border security resonated with many who were concerned about national security and the rule of law. His law-and-order approach was necessary for curbing rising crime rates, especially in Democrat-led cities. His foreign policy achievements, including the normalization of relations between Israel and Arab states in the form of the Abraham Accords, represented substantive progress in a region long marked by conflict."
            },
            "biography": {
                "birth_year": 1946,
                "birth_place": "Queens, New York",
                "education": [
                    "Fordham University",
                    "Wharton School of Finance at the University of Pennsylvania"
                ]
            },
            "social_media": {
                "website": "Not specified",
                "facebook": "Not specified",
                "twitter": "Not specified",
                "instagram": "Not specified",
                "youtube": "Not specified"
            }
        },
        {
            "name": "Tim Scott",
            "slug": "tim-scott",
            "withdrawn": true,
            "party": "Republican",
            "current_position": "U.S. Senator from South Carolina",
            "announcement_date": "May 22, 2023",
            "past_roles": [
                {
                    "role": "U.S. Senator from South Carolina",
                    "start_year": 2013,
                    "end_year": 2023
                },
                {
                    "role": "U.S. Representative for South Carolina's 1st Congressional District",
                    "start_year": 2011,
                    "end_year": 2013
                },
                {
                    "role": "Charleston County City Council",
                    "start_year": 1995,
                    "end_year": 2008
                }
            ],
            "quote": "I rose from a child of poverty to a candidate for president of the United States because we chose patriotism over pity and to be victors, not victims. Made in America. That's my story. That's why it pains my soul to see the Biden liberals attacking every rung of the ladder that helped me climb.",
            "key_legislation_or_accomplishments": [],
            "key_policy_points": [
                "Border Security",
                "Education",
                "Conservative Values and Rights",
                "National Security",
                "Law and Order",
                "Economic Opportunity and Growth"
            ],
            "policy_perspectives": {
                "left_leaning": "From a left-leaning viewpoint, Tim Scott's candidacy for the 2024 Presidential election may raise concerns due to his conservative stances on various issues. Critics on the left often view his strong emphasis on border security, including the construction of a border wall and stringent immigration policies, as lacking compassion and inclusivity. His opposition to what he terms as 'indoctrination' in education, particularly regarding gender and sexual identity topics, is seen as a step back in the progress of LGBTQ+ rights and diversity education. Scott's staunch pro-life stance and his efforts to uphold religious liberties are perceived as potentially infringing upon women's reproductive rights and the separation of church and state. His economic policies, focusing on tax cuts and reduced government spending, may be criticized for favoring the wealthy and corporations over the working class and the economically disadvantaged.",
                "centrist": "Centrists might view Tim Scott's candidacy as a blend of traditional conservative values with a pragmatic approach to governance. His story of personal triumph, rising from poverty to a position of influence, is likely to resonate as an embodiment of the American Dream. Centrists may appreciate his focus on law and order and support for law enforcement, seeing it as a necessary response to rising crime rates, though they might seek a more balanced approach that also addresses issues of police reform and racial justice. His economic agenda, emphasizing job creation and a Made in America approach, could appeal to those who prioritize economic stability and national self-reliance. However, centrists might be wary of his hardline stances on social issues and seek more moderate positions that accommodate a wider range of viewpoints.",
                "right_leaning": "From a right-leaning perspective, Tim Scott represents a strong conservative choice for the 2024 Presidential election. His commitment to border security and tough stance on illegal immigration align well with right-wing priorities of national sovereignty and law and order. Scott's advocacy for educational reform, particularly his opposition to critical race theory in schools, aligns with the conservative view of preserving traditional American values in education. His economic policies, which include tax cuts and reducing national debt, are likely to be well-received by those who advocate for smaller government and fiscal responsibility. Furthermore, his pro-life stance and emphasis on religious freedoms resonate deeply with conservative voters. Scott's narrative of personal success and self-reliance is seen as inspirational and a testament to conservative values of hard work and individualism."
            },
            "biography": {
                "birth_year": 1965,
                "birth_place": "North Charleston, South Carolina",
                "education": [
                    "Charleston Southern University, Bachelor’s degree in Political Science"
                ]
            },
            "social_media": {
                "website": "N/A",
                "facebook": "N/A",
                "twitter": "N/A",
                "instagram": "N/A",
                "youtube": "N/A"
            }
        }
    ],
    "latest_data_date": "2023-11-25T00:00:00.000Z"
}