{
    "candidates": [
        {
            "name": "Marianne Williamson",
            "slug": "marianne-williamson",
            "party": "Democratic",
            "current_position": "Author/Speaker",
            "announcement_date": "February 23, 2023",
            "past_roles": [
                {
                    "role": "Author",
                    "start_year": 1992,
                    "end_year": 2022
                }
            ],
            "quote": "Our deepest fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure.",
            "key_legislation_or_accomplishments": [],
            "running_mate_2020": "N/A",
            "key_policy_points": [
                "Universal Healthcare",
                "Climate Change",
                "Reparations"
            ],
            "policy_perspectives": {
                "left_leaning": "This candidate could be considered a strong advocate for progressive social and economic policies. Their stance on single-payer healthcare, reparations, and animal welfare resonate strongly with values often held by liberals. The emphasis on social justice, particularly in areas like criminal justice reform, disability rights, LGBTQIA+ rights, and Native American justice, underscores a comprehensive progressive agenda. Their economic policies, which discuss the need for an Economic Bill of Rights and criticize corporatization, would likely also be well-received by left-leaning individuals. Moreover, the candidate’s strong emphasis on climate action and peace-building might be seen as a fresh and urgently needed approach.",
                "centrist": "Centrists might find this candidate's platform to be a mixed bag. While the emphasis on child advocacy, education, and food safety could be universally appealing, the approach to issues like the economy and criminal justice may be considered too far-reaching or radical. Centrists might appreciate the focus on \"care economy\" and humane treatment of all individuals but may be skeptical of the feasibility or practicality of implementing single-payer healthcare or reparations. The candidate’s commitment to social justice is notable but could be viewed as overly idealistic or ambitious for centrists who often seek compromise and incremental change.",
                "right_leaning": "This candidate's policy points may raise several concerns. The emphasis on single-payer healthcare, reparations, and what could be considered 'big government' solutions might not sit well with conservative values, which generally favor smaller government and individual liberties. The stance on gun safety, framed as an emergency, might be seen as an attack on Second Amendment rights. Moreover, economic viewpoints that critique corporate interests and advocate for a \"care economy\" might be seen as antithetical to free-market principles. The approach to immigration, while compassionate, may also not align with more conservative views that emphasize border security."
            },
            "biography": {
                "birth_year": 1952,
                "birth_place": "Houston, Texas",
                "education": [
                    "Pomona College"
                ]
            },
            "social_media": {
                "website": "https://marianne.com/",
                "facebook": "williamsonmarianne",
                "twitter": "marwilliamson",
                "instagram": "mariannewilliamson",
                "youtube": "MarianneWilliamson"
            }
        },
        {
            "name": "Cornel West",
            "slug": "cornel-west",
            "party": "Green",
            "current_position": "Dietrich Bonhoeffer Chair at Union Theological Seminary, Academic, Activist",
            "announcement_date": "June 5, 2023",
            "past_roles": [
                {
                    "role": "Assistant Professor at Union Theological Seminary",
                    "start_year": 1980,
                    "end_year": 1982
                },
                {
                    "role": "Professor at various universities including Harvard, Yale, Princeton",
                    "start_year": 1980,
                    "end_year": 2021
                },
                {
                    "role": "Honorary Chairman of the Democratic Socialists of America",
                    "start_year": 2000,
                    "end_year": 2001
                }
            ],
            "quote": "You can’t lead the people if you don’t love the people. You can’t save the people if you don’t serve the people.",
            "key_legislation_or_accomplishments": [
                "Published 20 books including 'Race Matters', 'Democracy Matters: Winning the Fight Against Imperialism', 'Black Prophetic Fire'"
            ],
            "running_mate_2024": "",
            "key_policy_points": [
                "Issues of race, class, and justice",
                "Democratic socialism",
                "Christian moral sensibility",
                "American pragmatism"
            ],
            "policy_perspectives": {
                "left_leaning": "West's academic focus and activism around issues of race, class, and justice place him firmly within the progressive sphere. His association with democratic socialism underscores his left-leaning policies.",
                "centrist": "West's philosophical orientation, informed by the tradition of American pragmatism, could appeal to those in the center who prioritize practical solutions over ideological purity.",
                "right_leaning": "West's career has largely been in the academic and activist circles traditionally associated with left-leaning ideologies, making it challenging to identify policies that would align him with a right-leaning perspective."
            },
            "biography": {
                "birth_year": 1953,
                "birth_place": "Tulsa, Oklahoma",
                "education": [
                    "B.A. in Middle Eastern Languages and Literature from Harvard University",
                    "M.A. and Ph.D. in Philosophy from Princeton University"
                ]
            },
            "social_media": {
                "website": "",
                "facebook": "",
                "twitter": "",
                "instagram": "",
                "youtube": ""
            }
        },
        {
            "name": "Robert F. Kennedy Jr.",
            "slug": "robert-f-kennedy-jr",
            "party": "Democratic",
            "current_position": "Author and Lawyer",
            "announcement_date": "April 5, 2023",
            "past_roles": [
                {
                    "role": "Assistant District Attorney",
                    "start_year": 1982,
                    "end_year": 1983
                },
                {
                    "role": "Chief Attorney at Riverkeeper",
                    "start_year": 1985,
                    "end_year": 1987
                },
                {
                    "role": "Chairman and Attorney at Waterkeeper Alliance",
                    "start_year": 1999,
                    "end_year": 2017
                }
            ],
            "quote": "We will scale down the war machine and bring our resources home. We will rebuild our water systems, repair our roads, modernize our railroads, and clean up our environment...",
            "key_legislation_or_accomplishments": [],
            "key_policy_points": [
                "Increased government transparency and whistleblower protection",
                "Curb lobbying and the 'revolving door' between government and industry",
                "Address polarization and foster dialogue",
                "Transition to clean energy and preserve wild lands",
                "Economic revitalization focusing on small and medium businesses",
                "Transition from 'sick care' to 'wellness society'",
                "End American militaristic policies abroad",
                "Restore rights and liberties as outlined in the Bill of Rights"
            ],
            "policy_perspectives": {
                "left_leaning": "Kennedy's focus on environmental concerns, social reconciliation, and economic inequality aligns him with progressive values.",
                "centrist": "Kennedy aims to curb lobbying and protect whistleblowers, which can be seen as non-partisan issues aimed at improving government functionality.",
                "right_leaning": "Kennedy's criticism of former President Donald Trump's handling of the coronavirus lockdown may resonate with some conservatives who also opposed the lockdowns."
            },
            "biography": {
                "birth_year": 1954,
                "birth_place": "Washington, D.C.",
                "education": [
                    "B.A. in American History and Literature from Harvard University",
                    "Law Degree from the University of Virginia",
                    "Master's Degree in Environmental Law from Pace University"
                ]
            },
            "social_media": {
                "website": "",
                "facebook": "",
                "twitter": "",
                "instagram": "",
                "youtube": ""
            }
        },
        {
            "name": "Joe Biden",
            "slug": "joe-biden",
            "party": "Democratic",
            "current_position": "46th president of the United States",
            "announcement_date": "April 25, 2023",
            "past_roles": [
                {
                    "role": "Representative for Delaware in the U.S. Senate",
                    "start_year": 1973,
                    "end_year": 2009
                },
                {
                    "role": "Vice president under President Barack Obama",
                    "start_year": 2009,
                    "end_year": 2017
                }
            ],
            "quote": "I know America. I know we're good and decent people. I know we're still a country that believes in honesty and respect, and treating each other with dignity... And this is our moment.",
            "key_legislation_or_accomplishments": [
                "Infrastructure Investment and Jobs Act of 2021",
                "United States Chips and Science Act",
                "Inflation Reduction Act of 2022"
            ],
            "running_mate_2024": "U.S. Sen. Kamala Harris (D)",
            "key_policy_points": [
                "Make childcare and elder care more accessible",
                "Protect Social Security and Medicare",
                "Enact a minimum tax for billionaires",
                "Codify the right to abortion",
                "Ban assault weapons",
                "Support voting rights"
            ],
            "policy_perspectives": {
                "left_leaning": "President Joe Biden's re-election platform strongly aligns with progressive values. He is committed to protecting Social Security and Medicare, ensuring that the rich pay their fair share in taxes, and guaranteeing reproductive rights for women, all central tenets of left-leaning philosophy. His proposed ban on assault weapons reflects a necessary response to the current crisis of gun violence. Additionally, Biden's support for climate action and renewable energy investment reflects his alignment with progressive stances on environmental sustainability.",
                "centrist": "Biden's platform presents a balanced approach that marries progressive ideas with pragmatic policy-making. His commitment to make childcare and elder care more accessible to all Americans is not only socially progressive but also economically sound, and his determination to protect Social Security and Medicare is a testament to his commitment to the well-being of all citizens. His pledge to enact a minimum tax for billionaires signifies a fair tax system. His stance on gun control, while contentious, acknowledges the need for reform amidst increasing gun violence. The focus on manufacturing and job creation is in line with moderate economic principles, supporting both business and worker interests.",
                "right_leaning": "From a conservative standpoint, Biden's platform might raise concerns about potential overreach in economic and social policy. His plan to impose a minimum tax on billionaires could be seen as detrimental to economic growth and potentially discouraging for entrepreneurs and investors. The proposed ban on assault weapons may be viewed as an infringement on Second Amendment rights. Also, his stance on abortion rights contradicts the pro-life views held by many conservatives. While his commitment to job creation is laudable, concerns may arise over the potential costs and regulations associated with his environmental policies."
            },
            "biography": {
                "birth_year": 1942,
                "birth_place": "Scranton, Pennsylvania",
                "education": [
                    "University of Delaware with a degree in history and political science",
                    "Law degree from the Syracuse University Law School"
                ]
            },
            "social_media": {
                "website": "Joe Biden's campaign website",
                "facebook": "Joe Biden on Facebook",
                "twitter": "Joe Biden on Twitter",
                "instagram": "Joe Biden on Instagram",
                "youtube": "Joe Biden on YouTube"
            }
        },
        {
            "name": "Donald Trump",
            "slug": "donald-trump",
            "party": "Republican",
            "current_position": "45th President of the United States",
            "election_date": "2024",
            "announcement_date": "November 15, 2022",
            "past_roles": [
                {
                    "role": "45th President of the United States",
                    "start_year": 2017,
                    "end_year": 2021
                },
                {
                    "role": "Executive Producer of The Apprentice",
                    "start_year": 2004,
                    "end_year": 2015
                },
                {
                    "role": "Reform Party Presidential Candidate",
                    "start_year": 1999,
                    "end_year": 2000
                }
            ],
            "quote": "America's comeback starts right now. When I left office, the United States stood ready for its golden age. [...] Now we are a nation in decline. We are a failing nation. For millions of Americans, the past two years under Joe Biden have been a time of pain, hardship, anxiety, and despair.",
            "key_legislation_or_accomplishments": [
                "United States withdrawing from the Iran nuclear deal",
                "Passage of the Tax Cuts and Jobs Act of 2017",
                "First Step Act in 2018",
                "Reducing the size of the ISIS caliphate",
                "Establishing the Space Force as an independent military branch",
                "More than 200 federal judicial appointments, including three U.S. Supreme Court justices"
            ],
            "running_mate_2024": "Not specified",
            "key_policy_points": [
                "Rebuild the Greatest Economy in History",
                "Fair Trade for the American Worker",
                "Unleash Energy Dominance",
                "Secure Borders and Reclaim National Sovereignty",
                "War on the Drug Cartels",
                "Stop Crime and Restore Safety",
                "Renew American Strength and Leadership",
                "Reject Globalism and Embrace Patriotism",
                "Care For Our Veterans",
                "Protect Parents’ Rights",
                "Defend Law and Liberty",
                "End Censorship and Reclaim Free Speech",
                "Free, Honest and Lawful Elections",
                "Drain the Swamp of Washington Corruption",
                "Better Health Care Choices at Lower Costs"
            ],
            "policy_perspectives": {
                "left_leaning": "Donald Trump's policies disproportionately favor wealthy individuals and corporations over average Americans. His tax cuts primarily benefited the top income brackets, and deregulation often led to the erosion of workers' rights and environmental safeguards. His approach to trade wars and tariffs lacked nuance, causing harm to the American consumer and farmers. Trump's immigration and border policies were often criticized as inhumane and xenophobic. His stance on law and order was perceived as disproportionately harsh, particularly on marginalized communities, without adequately addressing the root causes of crime or offering reformative solutions. His foreign policies often distanced allies and his approach to climate change was considered regressive.",
                "centrist": "Donald Trump's administration had a mixed bag of successes and failures. He made significant strides in economic growth pre-COVID-19, but his methods were often contentious. His tax cuts did help stimulate the economy, yet they also increased the federal deficit. Trump was willing to challenge traditional trade agreements and confront China on unfair practices, but this led to volatile relations and uncertainties. On immigration, he prioritized border security but failed to propose comprehensive immigration reform. His focus on law and order appealed to some but also stirred controversies around racial profiling and police brutality. Trump's approach to foreign policy was unconventional; he engaged with North Korea and made peace deals in the Middle East but often at the cost of straining relations with long-time allies.",
                "right_leaning": "Donald Trump was an effective leader who unapologetically prioritized American interests. His tax cuts and deregulation policies revived the American economy, resulting in historically low unemployment rates for various demographic groups. Trump's aggressive trade policies were a long-overdue response to years of exploitation by other nations. His stance on immigration and border security resonated with many who were concerned about national security and the rule of law. His law-and-order approach was necessary for curbing rising crime rates, especially in Democrat-led cities. His foreign policy achievements, including the normalization of relations between Israel and Arab states in the form of the Abraham Accords, represented substantive progress in a region long marked by conflict."
            },
            "biography": {
                "birth_year": 1946,
                "birth_place": "Queens, New York",
                "education": [
                    "Fordham University",
                    "Wharton School of Finance at the University of Pennsylvania"
                ]
            },
            "social_media": {
                "website": "Not specified",
                "facebook": "Not specified",
                "twitter": "Not specified",
                "instagram": "Not specified",
                "youtube": "Not specified"
            }
        }
    ],
    "latest_data_date": "2021-12-01T00:00:00.000Z"
}